In [18]:
import pandas as pd
import numpy as np 

# display all the  rows
pd.set_option('display.max_rows', None)

# display all the  columns
pd.set_option('display.max_columns', None)

In [3]:
df=pd.read_csv('flights.csv')
print(df)

     year      month  passengers
0    1949    January         112
1    1949   February         118
2    1949      March         132
3    1949      April         129
4    1949        May         121
..    ...        ...         ...
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

[144 rows x 3 columns]

In [6]:
df.head()

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [7]:
df.tail()

     year      month  passengers
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

In [9]:
df.describe()

              year  passengers
count   144.000000  144.000000
mean   1954.500000  280.298611
std       3.464102  119.966317
min    1949.000000  104.000000
25%    1951.750000  180.000000
50%    1954.500000  265.500000
75%    1957.250000  360.500000
max    1960.000000  622.000000

In [11]:
df['year']

0      1949
1      1949
2      1949
3      1949
4      1949
       ...
139    1960
140    1960
141    1960
142    1960
143    1960
Name: year, Length: 144, dtype: int64

In [13]:
df['year'].describe()

count     144.000000
mean     1954.500000
std         3.464102
min      1949.000000
25%      1951.750000
50%      1954.500000
75%      1957.250000
max      1960.000000
Name: year, dtype: float64

In [19]:
df.value_counts()

year  month      passengers
1949  April      129           1
      August     148           1
1956  May        318           1
      November   271           1
      October    306           1
      September  355           1
1957  April      348           1
      August     467           1
      December   336           1
      February   301           1
      January    315           1
      July       465           1
      June       422           1
      March      356           1
      May        355           1
      November   305           1
      October    347           1
1956  March      317           1
      June       374           1
      July       413           1
1955  May        270           1
      December   278           1
      February   233           1
      January    242           1
      July       364           1
      June       315           1
      March      267           1
      November   237           1
1956  January    284           1
1955  October    274           1
      September  312           1
1956  April      313           1
      August     405           1
      December   306           1
      February   277           1
1957  September  404           1
1958  April      348           1
      August     505           1
1960  February   391           1
1959  November   362           1
      October    407           1
      September  463           1
1960  April      461           1
      August     606           1
      December   432           1
      January    417           1
1959  March      406           1
1960  July       622           1
      June       535           1
      March      419           1
      May        472           1
      November   390           1
      October    461           1
1959  May        420           1
      June       472           1
1958  December   337           1
      November   310           1
      February   318           1
      January    340           1
      July       491           1
      June       435           1
      March      362           1
      May        363           1
      October    359           1
1959  July       548           1
1958  September  404           1
1959  April      396           1
      August     559           1
      December   405           1
      February   342           1
      January    360           1
1955  August     347           1
      April      269           1
1954  September  259           1
1951  December   166           1
1950  May        125           1
      November   114           1
      October    133           1
      September  158           1
1951  April      163           1
      August     199           1
      February   150           1
1950  June       149           1
1951  January    145           1
      July       199           1
      June       178           1
      March      178           1
      May        172           1
      November   146           1
1950  March      141           1
      July       170           1
1951  September  184           1
1949  May        121           1
      December   118           1
      February   118           1
      January    112           1
      July       148           1
      June       135           1
      March      132           1
      November   104           1
1950  January    115           1
1949  October    119           1
      September  136           1
1950  April      135           1
      August     170           1
      December   140           1
      February   126           1
1951  October    162           1
1952  April      181           1
1954  October    229           1
      December   229           1
1953  May        229           1
      November   180           1
      October    211           1
      September  237           1
1954  April      227           1
      August     293           1
      February   188           1
1953  June       243           1
1954  January    204           1
      July       302           1
      June       264           1
      March      235           1
      May        234           1
      November   203           1
1953  March      236           1
      July       264           1
1952  August     242           1
      May        183           1
      December   194           1
      February   180           1
      January    171           1
      July       230           1
      June       218           1
      March      193           1
      November   172           1
1953  January    196           1
1952  October    191           1
      September  209           1
1953  April      235           1
      August     272           1
      December   201           1
      February   196           1
1960  September  508           1
dtype: int64

In [25]:
primeras_15_observaciones=df.head(15)
print(primeras_15_observaciones)

    year      month  passengers
0   1949    January         112
1   1949   February         118
2   1949      March         132
3   1949      April         129
4   1949        May         121
5   1949       June         135
6   1949       July         148
7   1949     August         148
8   1949  September         136
9   1949    October         119
10  1949   November         104
11  1949   December         118
12  1950    January         115
13  1950   February         126
14  1950      March         141

In [26]:
ultimas_15_observaciones=df.tail(15)
print(ultimas_15_observaciones)

     year      month  passengers
129  1959    October         407
130  1959   November         362
131  1959   December         405
132  1960    January         417
133  1960   February         391
134  1960      March         419
135  1960      April         461
136  1960        May         472
137  1960       June         535
138  1960       July         622
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

In [30]:
print(np.mean(df["passengers"]))
print(np.median(df["passengers"]))
print(np.std(df["passengers"]))

280.2986111111111
265.5
119.54904153277148

In [32]:
print(np.mean(ultimas_15_observaciones["passengers"]))
print(np.median(ultimas_15_observaciones["passengers"]))
print(np.std(ultimas_15_observaciones["passengers"]))
print(np.mean(primeras_15_observaciones["passengers"]))
print(np.median(primeras_15_observaciones["passengers"]))
print(np.std(primeras_15_observaciones["passengers"]))

459.2
432.0
75.29426715671431
126.8
126.0
12.681745410891462